loadTest/basic.yaml
config:
  target: "http://localhost:3000"
  plugins:
    expect: {}
    ensure: 
      p95: 200 # ms
      maxErrorRate: 2 # %

phases:
  - duration: 5 # sec
    arrivalRate: 1 # 1req/s
    name: "warming up"

  - duration: 10
    arrivalRate: 2
    rampTo: 100
    name: "ramping up"

  - duration: 15
    arrivalRate: 10
    name: "Sustained load"

scenarios:
  - name: "Healtcheck"
    flow:
      - get:
          url: "/healthcheck"
          expect:
            - statusCode: 200
  - name: "Delay"
    flow:
      - get:
          url: "/delay?seconds=0.1"
          expect:
            - statusCode: 200